import { SchoolTimetable } from "../types/timetable";
export { DAYS } from "./config";

export const DEFAULT_TIMETABLE: SchoolTimetable = {
  "1": {
    "1": {
      월: ["미적1", "정보과학", "공영2", "대수", "생명과학", "체육1", "공국2"],
      화: ["물질E", "물질E", "공국2", "역학E", "과제연구", "과제연구", "과제연구"],
      수: ["생명과학", "생명과학", "지구과학", "정보과학", "창체1", "창체1", "창체1"],
      목: ["체육1", "공영2", "대수", "공국2", "미적1", "지구과학", "지구과학"],
      금: ["미적1", "공영2", "대수", "물질E", "역학E", "역학E", "정보과학"],
    },
    "2": {
      월: ["체육1", "공영2", "생명과학", "생명과학", "정보과학", "공국2", "미적1"],
      화: ["지구과학", "지구과학", "정보과학", "대수", "과제연구", "과제연구", "과제연구"],
      수: ["물질E", "물질E", "역학E", "역학E", "창체1", "창체1", "창체1"],
      목: ["역학E", "체육1", "공영2", "미적1", "공국2", "대수", "생명과학"],
      금: ["공국2", "대수", "물질E", "정보과학", "공영2", "미적1", "지구과학"],
    },
    "3": {
      월: ["정보과학", "대수", "역학E", "역학E", "공영2", "미적1", "체육1"],
      화: ["공국2", "미적1", "생명과학", "생명과학", "과제연구", "과제연구", "과제연구"],
      수: ["체육1", "대수", "정보과학", "지구과학", "창체1", "창체1", "창체1"],
      목: ["미적1", "대수", "물질E", "물질E", "역학E", "공영2", "공국2"],
      금: ["지구과학", "지구과학", "공영2", "공국2", "생명과학", "정보과학", "물질E"],
    },
    "4": {
      월: ["역학E", "체육1", "미적1", "정보과학", "대수", "공영2", "지구과학"],
      화: ["체육1", "정보과학", "대수", "공국2", "과제연구", "과제연구", "과제연구"],
      수: ["미적1", "정보과학", "대수", "공국2", "창체1", "창체1", "창체1"],
      목: ["물질E", "물질E", "생명과학", "생명과학", "공영2", "역학E", "역학E"],
      금: ["공영2", "공국2", "지구과학", "지구과학", "물질E", "생명과학", "미적1"],
    },
  },
  "2": {
    "1": {
      월: ["생/지", "생/지", "한국사", "문학", "AP선대(정)", "AP선대(김)", "데과학"],
      화: ["AP물1", "AP물1", "데과학", "스포츠", "영어2", "한국사", "문학"],
      수: ["AP화1", "AP화1", "AP화1", "AP선대(김)", "창체2", "창체2", "창체2"],
      목: ["문학", "AP선대(김)", "AP선대(정)", "영어2", "생/지", "생/지", "한국사"],
      금: ["데과학", "AP선대(정)", "영어2", "AP화1", "AP선대(김)", "AP물1", "AP물1"],
    },
    "2": {
      월: ["AP화1", "AP화1", "AP화1", "한국사", "AP물1", "AP물1", "AP선대(정)"],
      화: ["AP선대(김)", "AP선대(정)", "생/지", "생/지", "스포츠", "영어2", "한국사"],
      수: ["문학", "AP선대(김)", "데과학", "영어2", "창체2", "창체2", "창체2"],
      목: ["AP선대(정)", "데과학", "생/지", "생/지", "AP물1", "AP물1", "문학"],
      금: ["문학", "한국사", "데과학", "영어2", "AP화1", "AP선대(정)", "AP선대(김)"],
    },
    "3": {
      월: ["AP물1", "AP물1", "문학", "AP선대(김)", "생/지", "생/지", "영어2"],
      화: ["데과학", "AP선대(김)", "AP선대(정)", "한국사", "문학", "스포츠", "영어2"],
      수: ["영어2", "AP선대(정)", "한국사", "데과학", "창체2", "창체2", "창체2"],
      목: ["AP물1", "AP물1", "문학", "AP선대(김)", "AP화1", "AP화1", "AP화1"],
      금: ["한국사", "AP선대(김)", "AP선대(정)", "데과학", "생/지", "생/지", "AP화1"],
    },
    "4": {
      월: ["AP선대(정)", "AP선대(김)", "생/지", "생/지", "AP화1", "AP화1", "AP화1"],
      화: ["AP선대(정)", "데과학", "AP선대(김)", "영어2", "한국사", "문학", "스포츠"],
      수: ["생/지", "생/지", "AP물1", "AP물1", "창체2", "창체2", "창체2"],
      목: ["데과학", "한국사", "영어2", "AP선대(정)", "문학", "AP선대(김)", "AP선대(정)"],
      금: ["영어2", "데과학", "AP물1", "AP물1", "문학", "AP화1", "한국사"],
    },
  },
  "3": {
    "1": {
      월: ["AP물2", "AP물2", "AP물2", "AP미2", "AP프로", "생실험", "생실험"],
      화: ["음연", "AP화2", "AP화2", "AP화2"],
      수: ["AP미2", "심영2", "AP미2", "운동", "창체3", "창체3", "창체3"],
      목: ["AP화2", "심영2", "경제", "AP미2", "AP물2", "AP프로", "AP미2"],
      금: ["운동", "AP미2", "경제", "심영2", "AP미2", "생실험", "생실험"],
    },
    "2": {
      월: ["생실험", "생실험", "심영2", "경제", "AP미2", "AP프로", "AP물2"],
      화: ["미창", "심영2", "AP미2", "AP미2"],
      수: ["AP물2", "AP물2", "AP물2", "AP미2", "창체3", "창체3", "창체3"],
      목: ["생실험", "생실험", "AP화2", "경제", "AP프로", "운동", "AP미2"],
      금: ["AP화2", "AP화2", "AP화2", "AP미2", "심영2", "AP미2", "운동"],
    },
    "3": {
      월: ["AP화2", "AP화2", "AP화2", "심영2", "AP물2", "AP미2", "경제"],
      화: ["생실험", "생실험", "미창", "AP미2"],
      수: ["심영2", "AP프로", "운동", "AP미2", "창체3", "창체3", "창체3"],
      목: ["AP물2", "AP물2", "AP물2", "AP화2", "AP미2", "AP미2", "AP프로"],
      금: ["AP미2", "심영2", "생실험", "생실험", "운동", "경제", "AP미2"],
    },
    "4": {
      월: ["심영2", "경제", "AP미2", "운동", "AP화2", "AP화2", "AP화2"],
      화: ["AP미2", "음연", "AP미2", "AP물2"],
      수: ["AP프로", "AP미2", "생실험", "생실험", "창체3", "창체3", "창체3"],
      목: ["심영2", "AP화2", "AP미2", "AP프로", "생실험", "생실험", "운동"],
      금: ["경제", "AP물2", "AP물2", "AP물2", "AP미2", "AP미2", "심영2"],
    },
  },
};
